blog-hugo/content/posts/dune-first-book.md
---
title: "My Thoughts on the first sub-book of Dune"
date: 2024-03-26T00:54:00+00:00
tags: ["opinion", "dune", "spoilers", "books", "fiction"]
draft: false
---

I have been reading Dune and finished the first sub-book, its a wonderful book
that has been somewhat spoiled for me in certain ways. Even still its a
thoroughly interesting book.
As a way to save space instead of typing up my thoughts directly into a discord
post I am going to type it into a blog post. This will be shorter, less
structured and somewhat akin to a conversation I am having by myself. So yeah.

**SPOILERS AHEAD YOU HAVE BEEN WARNED**


## The structure and clarifying what terms mean {#the-structure-and-clarifying-what-terms-mean}

Dune is large.
Through the many books, sequels, adaptations, and movies. When you
say the word "Dune" you in turn refer to every single entity and sub entity of
this franchise. When I refer to the book Dune, I am referring to the first book
in the series. When I am referring to the sub-books of Dune, I am referring
to the individual partitions within the book Dune. For me that is broken into
"Book 1: Dune", "Book 2: Muad'Dib", "Book 3: The Prophet". Idk if this is the
same or different in different publications but I will continue to refer to
these as the sub-books. I have finished the first sub-book and this is the basis
of most of what I am writing about


## The first book of Dune {#the-first-book-of-dune}

I don't know what it is about this book but Dune has gripped me and has not let
go. This is my second time starting Dune (I will get onto why later) but in
about a month I have powered through quite a bit of this book. In a lot of ways
its dense with meaning, meaning that does not always reveal itself until later. Its
descriptions are deep but do not drag. Its world is fleshed out but only as much
as needed (witty comparison to a Fremen or something). In other words it's well
written.

But to begin with, it is also slow. Within the first 250 pages not a lot of
action happens and this world is just being set up. Questions being asked and
the future being foreshadowed. But this is not to say it never picks up. Our
patience is rewarded as we finish this sub-book where all of this set up pays
off with a bang. This slowness does not detract however. The way Frank Herbert
uses words is able to convey such rich emotion, that I felt like I was riding in
that Thopter alongside Duke Leto, I could feel the weight that Barron Harkonen's
suspensors have to deal with, and feel actual disgust in his gluttony. It
requires underlining how well this book is written.


## On spoilers {#on-spoilers}

Before I get into the actual content of this book, Some words on my experiences
need to be mentioned as it will poison my thinkings.

I wish I could go into this book blind, but as I am writing this (March 2024)
the world is picking up Dune en mass and talking about it. So through osmosis
and my own stupidity I am learning things about the book I should not know. I am
now going to figure out how to spoiler text in a blog post but I will list some
of the small things I have seen. Also curse you Instagram reels.

If you have not finished the first two books of the Dune series. Then do not
open any of these. Don't open the last one unless you have finished the 6 books
(I have no idea where it comes from)

<details>
<summary>Spoiler 1</summary>
<div class="details">

Apparently Paul Atredies is going to commit an intergalactic genocide? and will
begin to lose our (the readers) support? This is sad for me as I will now be
asking the question. When will Paul turn? and strings I would not connect to a
genocide are now being connected. At this point in the book Paul is presented as
a character we should be supporting. I guess its about the journey but still I
wish that was a twist I would have discovered by myself. :(

Funnily enough the presentation of this fact have been about the movies (as far
as I am aware) and a lack of media literacy in people who think Paul is
presented as this hero and all actions he does is by extension of that fact,
justified.
</div>
</details>

<details>
<summary>Spoiler 2</summary>
<div class="details">

The Sand worms are the source of spice.
This is a detail I probably already knew as the character of Kynes hinted that
the sand worms are a critical part of the spice systems on Arakkis but even still
I hate how I did not get to discover this myself.
</div>
</details>

<details>
<summary>Spoiler 3</summary>
<div class="details">

Apparently Paul Merges with a Sand worm????

I am not sure of the context of this but this is one of those spoilers I can't
forget and will bite me as I read more.
</div>
</details>

This is only a spoiler if you are like me and don't want any thoughts about the
book to taint your experiences.

<details>
<summary>Thematic Spoiler</summary>
<div class="details">

The Fremen are this Islamic / Arab coded society and this entire book is a
metaphor for Colonialism, Interventionism and US imperialism in West Asia.

This is quite interesting to me as for the time being the book has not shown the
natives in as much detail as I would have liked nor fleshed out the relationship
between the settler population and the Fremen other than a few small scenes. It
also means I get to see what the book _says_ as I can't figure out where these
metaphors connect to the real world without more info.

This is a point I will revisit as I read more into the book, one I kinda new
existed but would have rather derived myself almost.
</div>
</details>

In this sense these spoilers don't stop me from reading but still do _spoil_ the
experience. I have had a few more paper cuts probably but ill add them as I
remember


## On this world and the characters of Dune {#on-this-world-and-the-characters-of-dune}

Within this world we seem to have some kind of overarching flavor of destiny.
Destiny for the desert plant of Arakis, destiny for each character that attaches
itself to this planet.

For Leto it is death. "There is nothing for him" the Reverend Mother says. For
Paul it is his roles as messiah. For the planet, illusions of a stable and
prolific water cycle. Nothing in this world seems to come completely
out of left field. There is always some kind of insight, some kind of
foreshadowing for these events. In this sense every word is something to hang
onto as if it leads to some kind of future event. This is not only something for
the reader because it has an effect on our characters. We see them refer back to
these prophecies as we continue through and work with the conclusions they come
too. We see how the world shapes these characters as they pick up its
mannerisms and movements.

It brings me onto the details of this world. It is not only painted with large
vistas but also with small details. One scene that sticks with me is when a
Fremen comes into the Arakeen great hall and spits on the table. Everyone was
ready to attack this person for disrespecting the Duke but in turn the person
sent ahead stops them and thanks them for the gesture of sharing his moisture
with the Duke, a great sign of respect on a planet where water is so very
scarce. Through little devices like this an entire canvas is painted. A culture
fleshed out and reinforcements of core ideas are shared.


## On the language of Dune {#on-the-language-of-dune}

I have heard from others that the language in this book required a glossary? To
me this feels odd as the book has not failed to cover its tracks.

Take for example the term "Mentat". This is referred to multiple times to
describe our characters, some of them belong to this class and they seem to be
made, but _what_ they are is never fully explained until Paul goes through this
transformation near the end of this sub-book. Through his experiences of this
transformation, we understand what makes a Mentat different from a person. This
applies to a couple more ideas and phrases. "Lisan Al-Gaib" is mentioned as some
kind of messiah figure but then Kynes actually goes into detail about it as he
sees Paul act like this messiah.

Muad'Dib is mentioned, again and again at the beginning of each chapter. Usually
in the header, from excerpts of his selected writings or children's guides or
other works by the Princess Irulan. But it is only until we reach the end of
this chapter that we see how its actually Paul who is this Muad'Dib and what it
means. He is not only this messiah "Lisan Al-Gaib" but also this leader.

This is not to say that if you were to use a glossary that the reading would be
spoiled but to say that the language is not there by accident and will resolve
itself as we move through this story.


## What I have learnt about myself while reading Dune {#what-i-have-learnt-about-myself-while-reading-dune}

I don't really have more to say about Dune the book. But while I have been
reading this I have learnt a few things about myself.

I can finish big books. With a little time before bed each day I can get through
large sections of a book. and I can do it in reasonable times. But in this case
I am helped by a few things

Good typesetting is a must. If a book has not been well typeset then its harder
to get through and I struggle to finish it. This is why I put dune down the
first time. The (digital) copy I had was hard to read and hard to parse. Not in
the sense the words were hard to read, but in the sense that different things
should look different. In this case what added to my confusion is that chapters
were not really separated and the chapter introductions by the Princess Irulan
were really not separated from the main body of text. All of this adds up to a
not great reading experience

I need smaller chapters I can see the progress of. I am a person, who partly
because of internet brain rot, needs smaller chapters I can see my progress in.
50 pages in a chapter is too much for me to read comfortably without some kind
of break. There are books where chapters represent hundreds of pages and you
need to kinda just pick a point to put it down. This is not to say I can't read
these books but like small chapters make it easy. This also feeds into
typesetting as my e-reader can track how far I am into a chapter. I can see I am
nearly done pretty quickly as a percentage and I can call it quits or keep going
pretty neatly.


## Conclusions {#conclusions}

Dune is a good book, Ill come back when I finish sub-book 2. All of this reads
as almost a superficial understanding of the book of Dune. I think that's okay
for the moment though as I have not gotten that deep into the book. Lets see how
I feel after finishing sub-book 2.

Also thanks to Leo from [A blog with relevant information](https://a-blog-with.relevant-information.com/) for proof reading my
work and suggesting some improvements. Hopefully next time the patch is a little
smaller!
